{"config": [{"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00faN/home/chu-chu/self_driving_car_nanodegree/CarND-Behavioral-Cloning-P3/model.py\u00da\b<lambda>\u0018\u0001\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape": null, "dtype": "float32", "batch_input_shape": [null, 66, 200, 3], "name": "lambda_1", "trainable": true, "arguments": {}, "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"trainable": true, "filters": 24, "padding": "valid", "kernel_size": [5, 5], "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "strides": [2, 2]}, "class_name": "Conv2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"trainable": true, "filters": 36, "padding": "valid", "kernel_size": [5, 5], "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "strides": [2, 2]}, "class_name": "Conv2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"trainable": true, "filters": 48, "padding": "valid", "kernel_size": [5, 5], "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_3", "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "strides": [2, 2]}, "class_name": "Conv2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"trainable": true, "filters": 64, "padding": "valid", "kernel_size": [3, 3], "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_4", "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"trainable": true, "filters": 64, "padding": "valid", "kernel_size": [3, 3], "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_5", "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "units": 100, "activity_regularizer": null, "trainable": true, "activation": "linear", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_1", "kernel_constraint": null, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}, "class_name": "ELU"}, {"config": {"bias_regularizer": null, "units": 50, "activity_regularizer": null, "trainable": true, "activation": "linear", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_2", "kernel_constraint": null, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}, "class_name": "ELU"}, {"config": {"bias_regularizer": null, "units": 10, "activity_regularizer": null, "trainable": true, "activation": "linear", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_3", "kernel_constraint": null, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_8"}, "class_name": "ELU"}, {"config": {"bias_regularizer": null, "units": 1, "activity_regularizer": null, "trainable": true, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_4", "kernel_constraint": null, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.8"}